#include <iostream>

using namespace std;


struct st{
    int a[100];
    int topIndex;
    st(){ 

/*
Конструктор дәл стурктураның атымен аталу керек. Ол конструктордің переменалары жұмыс істеу үшін керек, онсыз перемменалар жұмыс жасамайды.
Переман дегенде, бардық обявлять ететін контейнер, перемена, т.б. үшін керек.
Жалпы бұлар stack-тің қызметін массив тектес струтура арқылы жүзеге асырған түрі.
*/
        topIndex = -1;
    }

    int top(){ // Бұны шақырғанда, ең 1-ші элм. шығады.
        if(topIndex == -1) return -1;
        return a[topIndex];
    }

    void push(int x){
        topIndex++;
        a[topIndex] = x; // Бәрін пока массивке салып аламыз.
    }

    void pop(){
        if(topIndex != -1){ // Осы фун. шақырып, stack секілді келесі элементке өтеміз, размерін -1 азайып отырып.
            topIndex--;
        }
    }
};

//Структура ол барлығы үшін доступнно яғни public болады. Ал класс C++ тілінде private болады, яғни не всем доступнно болады.

int main(){

    st s;

    int d[] = {1, 10, 2, 3, 5, 4};
    int n = sizeof(d) / sizeof(int);

    for(int i = 0; i < n; ++i){
        s.push(d[i]);
    }

    s.a[2] = 3; // Осылай өзгерте салауға болады структура үшін.

    for(int i = 0; i < n; ++i){
        cout << s.top() << endl;
        s.pop();
    }


    cout << endl;

     
    for(int i = 0; i < n; ++i){
        cout << s.a[i] << " ";
    }


    return 0;
}